erikarn/wtf-os/src/boards/stm32f429-discovery/test_userload.c
/*
 * Copyright (C) 2022 Adrian Chadd <adrian@freebsd.org>.
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 * SPDX-Licence-Identifier: GPL-3.0-or-later
 */

#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>

#include "bsp/local/os/reg.h"
#include "bsp/local/stm32f4/stm32f429_hw_flash.h"
#include "bsp/local/stm32f4/stm32f429_hw_usart.h"
#include "bsp/local/stm32f4/stm32f429_hw_rcc.h"
#include "bsp/local/stm32f4/stm32f429_hw_rcc_defs.h"
#include "bsp/local/stm32f4/stm32f429_hw_gpio.h"
#include "bsp/local/stm32f4/stm32f429_hw_exti.h"
#include "bsp/local/stm32f4/stm32f429_hw_syscfg.h"

#include "hw/types.h"

#include "kern/console/console.h"
#include "kern/core/task.h"
#include "kern/core/timer.h"
#include "kern/core/physmem.h"
#include "kern/user/user_exec.h"

/* flash resource */
#include "kern/flash/flash_resource.h"

/* resource paks */
#include "kern/flash/flash_resource_header.h"
#include "kern/flash/flash_resource_pak.h"

#include "core/platform.h"
#include "core/lock.h"
#include "core/arm_m4_systick.h"
#include "core/arm_m4_nvic.h"
#include "core/arm_m4_mpu.h"

extern flash_resource_span_t flash_span;

void
test_userload(void)
{
    struct flash_resource_pak pak;

    /* Ok, let's try loading TEST.BIN */
    /*
     * XXX TODO: for now, we aren't going to implement MPU support.
     * Once this actually works, we can figure out how to populate the
     * segments in a non-terrible way, and also figure out how to track
     * all of these memory allocations in the user task struct.
     */
    if (flash_resource_lookup(&flash_span, &pak, "TEST.BIN")) {
        struct user_exec_program_header hdr = { 0 };
        struct user_exec_program_addrs addrs = { 0 };

        console_printf("[wtfos] Found TEST.BIN!\n");

        if (user_exec_program_parse_header(pak.payload_start, pak.payload_size,
          &hdr) == false) {
             console_printf("[wtfos] failed to parse program header\n");
             return;
        }
        console_printf("[wtfos] parsed program header\n");

        /*
         * Header is now parsed out, time to allocate memory for our regions.
         * The copying / populating is done by user_exec_program_setup_segments()
         *
         * (Although right now we're not copying text or rodata, as we're
         * expecting them to be in flash.)
         */

        /* TEXT if needed, else just point to flash offset - ro, exec */
	console_printf("[prog] text = 0x%x, %d bytes\n", hdr.text_offset, hdr.text_size);

        /* GOT - noexec, ro */
	console_printf("[prog] got = 0x%x, %d bytes\n", hdr.got_offset, hdr.got_size);

        /* BSS - noexec, rw */
	console_printf("[prog] bss = 0x%x, %d bytes\n", hdr.bss_offset, hdr.bss_size);

        /* DATA - noexec, rw */
	console_printf("[prog] data = 0x%x, %d bytes\n", hdr.data_offset, hdr.data_size);

        /* RODATA if needed, else just point to flash offset - ro, noexec */
	console_printf("[prog] rodata = 0x%x, %d bytes\n", hdr.rodata_offset, hdr.rodata_size);

        /* HEAP - noexec, rw */
	console_printf("[prog] heap = %d bytes\n", hdr.heap_size);

        /* STACK - noexec, rw */
	console_printf("[prog] stack = %d bytes\n", hdr.stack_size);

        /*
         * TODO: which segments can we coalesce together to take up less MPU
         * slots?  The STM32F4 only has 8 MPU slots, so we'd end up with
         * only one free for hardware access.
         */

#if 0
        /*
         * Parse / update relocation entries and other segment offset stuff.
         */
        if (user_exec_program_setup_segments(pak.payload_start, pak.payload_size,
          &hdr, &addrs) == false) {
        }
#endif
        /*
         * Here we have the parsed out segments, allocated memory and now
         * populated them with the relevant contents.
         *
         * In theory we can now setup the task, setup r9 with the right GOT base
         * value, and start execution!
         */

    }
}
